Revit 2024 API
StairsPath.TextOrientation Property
 The orientation of stair up and down text.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public StairsTextOrientation TextOrientation { get; set; }
Visual Basic
Public Property TextOrientation As StairsTextOrientation
	Get
	Set
Visual C++
public:
property StairsTextOrientation TextOrientation {
	StairsTextOrientation get ();
	void set (StairsTextOrientation value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
StairsPath Class
Autodesk.Revit.DB.Architecture Namespace